Load SQL

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://temp.db

In [ ]:
%%sql
CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
    );

In [ ]:
%%sql
INSERT INTO Persons (PersonID, LastName, FirstName, Address, City)
VALUES ('1', 'Ben G.', 'Benedickt', 'Long Street', 'San Francisco');

In [21]:
%%sql 
SELECT * FROM Persons

 * sqlite://
Done.

[(1, 'Tom B.', 'Erichsen', 'Long Street', 'San Francisco'),
 (1, 'Tom B.', 'Erichsen', 'Long Street', 'San Francisco'),
 (1, 'Tom G.', 'Benedickt', 'Long Street', 'San Francisco'),
 (1, 'Ben G.', 'Benedickt', 'Long Street', 'San Francisco')]